<script setup lang="ts">
  interface IArticleBlock {
    title: string;
    textList: string[];
  }

  const articleList = ref<IArticleBlock[]>([
    {
      title: "Заголовок 1",
      textList: [
        "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях.",
        "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси.",
      ],
    },
    {
      title: "Заголовок 2",
      textList: [
        "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. ",
      ],
    },
    {
      title: "Заголовок 3",
      textList: [
        "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. Тележка прекрасно подходит для использования во дворах многоквартирных домов, обработки территорий промышленных предприятий, востребована владельцами магазинов, различных коммерческих компаний. Кроме того, она может использоваться для высева семян на газонах, теннисных кортах и других территориях.",
        "Представленная тележка-дозатор обеспечивает высококачественную обработку любых территорий сыпучими противогололедными реагентами самых разных типов, включая такие тяжелые, как гранитная и мраморная крошка, песок и пескосоляные смеси. ",
      ],
    },
  ]);
</script>

<template>
  <div class="article">
    <MainContainer class="article__container">
      <div class="article__bread-crumbs">
        <slot name="bread-crumbs" />
      </div>
      <MainTitle class="article__title">
        <slot name="title" />
      </MainTitle>
      <div class="article__content">
        <ArticleBlock v-for="{ title, textList } in articleList">
          <template #title> {{ title }} </template>
          <template #body>
            <p v-for="text in textList">{{ text }}</p>
          </template>
        </ArticleBlock>
      </div>
    </MainContainer>
  </div>
</template>

<style scoped lang="scss">
  .article {
    @apply mb-[10px];
    &__container {
      @apply grid;
    }
    // .article__bread-crumbs
    &__bread-crumbs {
      @apply mt-[20px];
    }
    // .article__title
    &__title {
      @apply mt-[20px];
    }
    // .article__content
    &__content {
      @apply mt-[40px] grid gap-[30px];

      @media (max-width: 1100px) {
        @apply gap-[15px] mt-[10px];
      }
    }
  }
</style>
